# Лабораторная работа №3: Обратная польская нотация и дерево выражения

## Автор
Китаева Дарья Максимовна. Группа: М8О-102БВ-25.

## Цель работы
Реализовать программу на языке C для разбора арифметических выражений, их преобразования в обратную польскую нотацию, построения дерева выражения, вычисления результата и тестирования корректности работы алгоритмов.

## Возможности
- Ввод арифметического выражения (поддерживаются *, -, скобки, числа)
- Проверка корректности выражения
- Преобразование в обратную польскую нотацию (ОПЗ)
- Построение дерева выражения
- Вывод дерева и выражения в разных формах
- Вычисление результата выражения
- Автоматическое тестирование на наборе файлов


## Описание функций
- **create_number** - Создает узел дерева, представляющий число. Выделяет память, устанавливает тип 'n' (число), сохраняет числовое значение в поле data, обнуляет остальные поля (operator, left, right, prev) и возвращает указатель на созданный узел.
- **create_operator** - Создает узел дерева, представляющий оператор. Выделяет память, устанавливает тип 'o' (оператор), сохраняет символ оператора, связывает левое и правое поддеревья, обнуляет поле prev и возвращает указатель на созданный узел.
- **reverse_polish** - Преобразует выражение из инфиксной формы в обратную польскую нотацию. Проходит по строке, игнорирует пробелы, числа сразу записывает в выходную строку, операторы помещает в стек с учетом приоритетов, скобки обрабатывает по особым правилам. В конце выталкивает все оставшиеся операторы из стека.
- **build_tree** - Строит бинарное дерево выражений на основе обратной польской нотации. Проходит по строке RPN, числа превращает в узлы-листья и помещает в стек, при встрече оператора извлекает два верхних узла из стека (правое и левое поддеревья), создает узел-оператор и помещает его обратно в стек. Возвращает корень дерева.
- **calculate** - Рекурсивно вычисляет значение арифметического выражения, представленного деревом. Для узлов-чисел возвращает их значение, для узлов-операторов рекурсивно вычисляет левое и правое поддеревья, затем применяет оператор (умножение или вычитание) и возвращает результат.
- **tree_to_string** - Рекурсивно преобразует дерево в строку в инфиксной форме. Использует переданный индекс для позиционирования в строке-буфере. Числа преобразует в строковый формат через sprintf, операторы и скобки добавляет посимвольно. Аналогична print_tree, но записывает результат в строку, а не выводит на экран.
- **free_tree** - Рекурсивно освобождает всю память, выделенную под дерево выражений. Последовательно обходит левое и правое поддеревья, освобождая их, затем освобождает текущий узел. Предотвращает утечки памяти.
- **polish_notation** - Выводит обратную польскую нотацию (переданную строку RPN) на экран. Простая функция-обертка для отображения результата преобразования.
- **print_tree** - Рекурсивно выводит дерево в инфиксной форме с расстановкой скобок. Для узлов-чисел выводит значение, для узлов-операторов выводит открывающую скобку, левое поддерево, пробел, оператор, пробел, правое поддерево и закрывающую скобку.


# Функция варианта №10
1. проверяем подходит ли наше выражение под условие с помощью функции валидации;
```c
bool validate_expression_my_func(const char* expr)
```
2. создаём и иницилизируем стек и остальные переменные, нужные при выполнении программы;
3. заходим в цикл, который проходится по строке до момента, пока не встретит конец строки;
4. если встречаем число, то проходимя по всем его цифрам и после пушим это число в стек;
5. если это не число, то просто переходим к следующему символу;
```c
else{
    i++;
    continue;
    }
```
6. после того, как все числа оказались у нас в стеке, забираем их из стека, присваивая переменным;
7. выводим ответ, не забывая про порядок вывода переменных.
```c
printf("Func result: %d*%d - %d*%d", num3, num2, num3, num1);
```



## Структура проекта

<pre>
.
├── main.c              # Главная программа (ввод, обработка выражения)
├── reverse_polish.c    # Преобразование в ОПЗ, дерево выражения
├── reverse_polish.h    # Заголовочный файл
├── stack.c             # Реализация стека для дерева
├── stack.h             # Заголовочный файл для стека
├── validation.c        # Проверка корректности выражения
├── tests.c             # Автоматические тесты
├── Makefile            # Сборка проекта
├── README.md           # Описание проекта
└── .gitignore
</pre>

## Сборка
Выполните в терминале:
```sh
make all
```
Будут собраны main.exe и tests.exe.

## Запуск
Для запуска основной программы:
```sh
./main.exe
```
Следуйте инструкциям для ввода выражения.

## Тестирование
Для запуска тестов:
```sh
./tests.exe
```

## Очистка
Для удаления всех скомпилированных файлов и тестовых данных:
```sh
make clean
```

## Вывод
В ходе лабораторной реализованы: преобразование выражения в ОПН, построение дерева, вычисление результата, автоматические тесты. Проект структурирован для удобства сборки и проверки.
